#Область ПрограммныйИнтерфейс

// Отправка сообщения о новой/измененной заявке в Телеграм
Процедура ОтправитьУведомленияВТелеграм() Экспорт
	
	Токен = Константы.BKM_ТокенУправленияТелеграмБотом.Получить();
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сообщение в Телеграм не отправлено.", УровеньЖурналаРегистрации.Ошибка,,, 
		"Токен для Телегам не установлен.");
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторЧата = Константы.BKM_ИдентификаторГруппыДляОповещения.Получить();
	
	Если Не ЗначениеЗаполнено(ИдентификаторЧата) Тогда
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сообщение в Телеграм не отправлено.", УровеньЖурналаРегистрации.Ошибка,,, 
		"Идентификатор чата для Телеграм не установлен.");
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	BKM_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	BKM_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.BKM_УведомленияТелеграмБоту КАК BKM_УведомленияТелеграмБоту";

	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Ответ = ОтправитьСообщениеВТелеграм(Выборка.ТекстСообщения, Токен, ИдентификаторЧата);
		Если Ответ = Неопределено Тогда
			
			Продолжить;	
			
		КонецЕсли; 
		
		Если Ответ.КодСостояния = 200 Тогда
			
			УведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();	
			УведомлениеОбъект.Удалить();
			
		Иначе
			
			ОписаниеОшибки = Ответ.ПолучитьТелоКакСтроку();	
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Отправка сообщений в телеграм. Сообщение не отправлено.", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтправитьСообщениеВТелеграм(Знач ТекстСообщения, Знач Токен, Знач ИдентификаторЧата)
	
	Ответ = Неопределено;
	
	Попытка 
		
		Соединение = Новый HTTPСоединение("api.telegram.org",,,,,, ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
		
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("chat_id",ИдентификаторЧата);
		ДанныеСообщения.Вставить("text",ТекстСообщения);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,ДанныеСообщения);
		СообщениеДляОтправки = ЗаписьJSON.Закрыть();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("content-type", "application/json");
		
		АдресURL = СтрШаблон("/bot%1/sendMessage", Токен);
		HTTPЗапрос = Новый HTTPЗапрос(АдресURL, Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(СообщениеДляОтправки);
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Отправка сообщения в телеграм. Непредвиденная ошибка.",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());		
		Возврат Неопределено;
		
	КонецПопытки;
	
		Возврат Ответ;
		
КонецФункции

#КонецОбласти


