#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Создание списка документов Реализации товаров и услуг за указанный период (месяц)
//
// Возвращаемое значение:
//   Структура: 
//   * СозданоДокументов - Число
//   * МассивДоговоровИРеализаций - Массив из Структура
//   
// Параметры:  
//     ДатаНачала - Дата - Дата начала месяца
//     ДатаОкончания - Дата - Дата окончания месяца 
Функция СоздатьДокументыРеализации(ДатаНачала, ДатаОкончания) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|	ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	|ГДЕ
	|	ДоговорыКонтрагентов.BKM_ДатаНачалаДействияДоговора <= &ДатаНачала
	|	И ДоговорыКонтрагентов.BKM_ДатаОкончанияДействияДоговора >= &ДатаОкончания
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РеализацияТоваровУслуг.Проведен
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание)";


	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДатаОкончания));

	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();

	СозданоДокументов = 0;
	
	СписокДоговоровИРеализаций = Новый ТаблицаЗначений;
	СписокДоговоровИРеализаций.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	СписокДоговоровИРеализаций.Колонки.Добавить("Реализация",
		Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));

	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Реализация) Тогда
			ДокументРеализация  = Выборка.Реализация.ПолучитьОбъект();
			
		Иначе 
		
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументРеализация.Заполнить(Выборка);
			ДокументРеализация.Дата = КонецМесяца(ДатаОкончания);
			ДокументРеализация.Договор = Выборка.Договор;
			ДокументРеализация.Организация = Выборка.Организация;
			ДокументРеализация.Контрагент = Выборка.Контрагент;
			ДокументРеализация.ПроверитьЗаполнение();
		
			СозданоДокументов = СозданоДокументов + 1;
		
		КонецЕсли;

		ДокументРеализация.BKM_ВыполнитьАвтозаполнение();

		ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		
		Строка = СписокДоговоровИРеализаций.Добавить();
		Строка.Договор = Выборка.Договор;
		Строка.Реализация = ДокументРеализация.Ссылка;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("МассивДоговоровИРеализаций", ОбщегоНазначения.ТаблицаЗначенийВМассив(СписокДоговоровИРеализаций));
	Результат.Вставить("СозданоДокументов",СозданоДокументов);

	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли