#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Создание списка документов Реализации товаров и услуг за указанный период (месяц)
//
// Возвращаемое значение:
//   Структура: 
//   * СозданоДокументов - Число
//   * МассивДоговоровИРеализаций - Массив из Структура
//   
// Параметры:  
//     ДатаНачала - Дата - Дата начала месяца
//     ДатаОкончания - Дата - Дата окончания месяца 
Функция СоздатьДокументыРеализации(ДатаНачала, ДатаОкончания) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.BKM_ДатаНачалаДействияДоговора <= &ДатаНачала
	|	И ДоговорыКонтрагентов.BKM_ДатаОкончанияДействияДоговора >= &ДатаОкончания
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание)
	|	И ДоговорыКонтрагентов.Ссылка НЕ В
	|		(ВЫБРАТЬ
	|			ДоговорыКонтрагентов.Ссылка КАК Договор
	|		ИЗ
	|			Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|				ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	|		ГДЕ
	|			РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|			И РеализацияТоваровУслуг.Дата <= &ДатаОкончания)";

	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДатаОкончания));

	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();

	СозданоДокументов = 0;
	СписокДоговоровИРеализаций = Новый ТаблицаЗначений;
	СписокДоговоровИРеализаций.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	СписокДоговоровИРеализаций.Колонки.Добавить("Реализация",
		Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));

	Пока Выборка.Следующий() Цикл
		
		ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокументРеализация.Заполнить(Выборка);
		ДокументРеализация.Дата = КонецМесяца(ДатаОкончания);
		ДокументРеализация.Договор = Выборка.Договор;
		ДокументРеализация.Организация = Выборка.Организация;
		ДокументРеализация.Контрагент = Выборка.Контрагент;
		ДокументРеализация.ПроверитьЗаполнение();

		ДокументРеализация.BKM_ВыполнитьАвтозаполнение();

		ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		
		СозданоДокументов = СозданоДокументов + 1;

		Строка = СписокДоговоровИРеализаций.Добавить();
		Строка.Договор = Выборка.Договор;
		Строка.Реализация = ДокументРеализация.Ссылка;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("МассивДоговоровИРеализаций", ОбщегоНазначения.ТаблицаЗначенийВМассив(СписокДоговоровИРеализаций));
	Результат.Вставить("СозданоДокументов",СозданоДокументов);

	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли