//Процедура ДополнитьФорму(Форма) Экспорт 
//	
//	ИмяФормы = Форма.ИмяФормы; 
//	
//	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
//		ПутьВидДоговора = Этот.Ссылка;
//		
//		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПутьВидДоговора,"ВидДоговора.Наименование");
//		Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание") Тогда
//			ДобавитьПоляДляАбонентскогоДоговора(Форма);
//		КонецЕсли;
//
//	КонецЕсли;
//		
//		
//	
//КонецПроцедуры
//
//Процедура ДобавитьПоляДляАбонентскогоДоговора(Форма)
//	
//	ПолеВводаДатаНачалаДоговора = Форма.Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ,Форма.Элементы.ВидДоговора);
//	ПолеВводаДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
//	ПолеВводаДатаНачалаДоговора.ПутьКДанным = "Объект.BKM_ДатаНачалаДействияДоговора";	 
//	
//КонецПроцедуры