#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)

	Если Не ЗначениеЗаполнено(Объект.Период) Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните период для создания актов реализации товаров и услуг.
													|Обработка не запущена", , "Объект.Период");
		Возврат;

	КонецЕсли;

	ДлительнаяОперация = СоздатьДокументыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьДокументыНаСервере()

	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"Обработки.BKM_МассовоеСозданиеАктов.СоздатьДокументыРеализации", Объект.Период.ДатаНачала,
		Объект.Период.ДатаОкончания);
	Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеОкончания(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.Статус = "Ошибка" Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;

	КонецЕсли;

	Если Результат = Неопределено Тогда  // Пользователь отменил задание

		ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка отменена пользователем.
													|Возможно некоторые документы не созданы.
													|Рекомендуется перезапустить обработку и дождаться ее завершения.");
		Возврат;

	КонецЕсли;

	РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);

	Объект.ДоговорыИРеализации.Очистить();

	Если Результат.Статус = "Выполнено" Тогда

		Если РезультатОбработки.СозданоДокументов = 0 Тогда

			ТекстСообщения = "Для выбранного периода все документы Реализации товаров и услуг по абонентским договорам созданы";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;

		Иначе

			ЗаписатьСписокДокументов(РезультатОбработки.МассивДоговоровИРеализаций);

			ТекстСообщения = СтрШаблон("Для указанного периода количество успешно созданных документов - %1",
				РезультатОбработки.СозданоДокументов);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСписокДокументов(МассивСписка)
	
	
	Для Каждого ЭлементМассива Из МассивСписка Цикл

		СтрокаСписка = Объект.ДоговорыИРеализации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписка, ЭлементМассива);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти